qwer = {'ID' : '6', 'Прізвище' : 'Дячук', "Ім'я" : 'Вадим' , 'Група' : 'ІПЗс-23-2' , 'Курс'  : '1', "книги" : [], 'Статистика книг' : []}
print( "ID = " + qwer['ID'])
print( "Ім'я = " + qwer["Ім'я"])
print( "Група = " + qwer["Група"])
print( "Курс = " + qwer["Курс"])
print( "Книги (борги) = ", qwer["книги"])
print( "Статистика книг = " , qwer["Статистика книг"])


while True:
    ss = input("0 - вийти з програми - \n1 - видати карту читача\n2 - вибрати книгу яку бажаєте взяти\n3 - повернути книгу\nВведіть потрібну цифру - ")
    if ss == '1':
        print( "ID = " + qwer['ID'])
        print( "Прізвище" + qwer['Прізвище'])
        print( "Ім'я = " + qwer["Ім'я"])
        print( "Група = " + qwer["Група"])
        print( "Курс = " + qwer["Курс"])
        print( "Книги (борги) = ", qwer["книги"])
        print( "Статистика книг = " , qwer["Статистика книг"])
    elif ss == '2':
        s1 = input('Введіть назву книги яку хочете взяти: ')
        qwer['книги'].append(s1)
    elif ss == '3':
        s2 = input('Введіть назву книги яку ви хочете повернути: ')
        qwer['книги'].remove(s2)
        qwer["Статистика книг"].append(s2)
    elif ss == '0':
        print('Ви вийшли з програми')
        break
